In [1]:
import seaborn as sns
import pandas as pd

iris = sns.load_dataset("iris")
result = iris.loc[:,['sepal_length','species']]
result.head(1)

   sepal_length species
0           5.1  setosa

In [2]:
result.to_excel('dataset/output.xlsx',sheet_name='Sheet_name_1',index=False)

# groupby 연산
- 집계함수와 같이 사용
- 그룹 별 비교 및 분석

In [3]:
import seaborn as sns
tips = sns.load_dataset("tips")
tips.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

## 성별로 tip 평균 구하기

In [9]:
tips.groupby('sex',observed=True)['tip'].mean()

# 통계적으로 유의한가 : 기초 통계 영역으로 넘어감.

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [14]:
# 요일별 총 결제 금액 구하기 
# 집계함수 : sum()
tips.groupby('day',observed=True)['total_bill'].sum()

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

## 요일 & 성별 팁 평균

In [16]:
tips.groupby(['day','sex'],observed=True)['tip'].sum()

day   sex
Thur  Male       89.41
      Female     82.42
Fri   Male       26.93
      Female     25.03
Sat   Male      181.95
      Female     78.45
Sun   Male      186.78
      Female     60.61
Name: tip, dtype: float64

## 식사 시간별 인원 수 평균

In [17]:
tips.groupby(['time'],observed=True)['size'].mean()

time
Lunch     2.411765
Dinner    2.630682
Name: size, dtype: float64

### 개인연습

In [18]:
tips['tip_ratio'] = tips['tip'] / tips['total_bill']
tips.groupby(['time','sex'],observed=True)['tip_ratio'].mean()

time    sex
Lunch   Male      0.166083
        Female    0.162285
Dinner  Male      0.155407
        Female    0.169322
Name: tip_ratio, dtype: float64

## 두 가지 범주 출력 변환

In [23]:
result = tips.groupby(['day','sex'],observed=True)['tip'].mean()
result.unstack() # 히트맵 시각화 적용 가능

sex       Male    Female
day
Thur  2.980333  2.575625
Fri   2.693000  2.781111
Sat   3.083898  2.801786
Sun   3.220345  3.367222

## 집계함수 두 개 이상 사용

In [27]:
result = tips.groupby(['day','sex'],observed=True)[['tip','total_bill']].agg(['sum','mean','var'])
result

                tip                     total_bill
                sum      mean       var        sum       mean         var
day  sex
Thur Male     89.41  2.980333  1.832596     561.44  18.714667   64.316033
     Female   82.42  2.575625  1.230516     534.89  16.715312   60.213942
Fri  Male     26.93  2.693000  1.291468     198.57  19.857000  100.317201
     Female   25.03  2.781111  0.881461     127.31  14.145556   22.930178
Sat  Male    181.95  3.083898  3.208969    1227.35  20.802542   96.752916
     Female   78.45  2.801786  1.523941     551.05  19.680357   77.553915
Sun  Male    186.78  3.220345  1.615877    1269.46  21.887241   83.341231
     Female   60.61  3.367222  1.292257     357.70  19.872222   61.426607

In [29]:
result.columns

MultiIndex([(       'tip',  'sum'),
            (       'tip', 'mean'),
            (       'tip',  'var'),
            ('total_bill',  'sum'),
            ('total_bill', 'mean'),
            ('total_bill',  'var')],
           )

In [30]:
result.columns = ['_'.join(col) for col in result.columns]
result.reset_index()

,day,sex,tip_sum,tip_mean,tip_var,total_bill_sum,total_bill_mean,total_bill_var
0,Thur,Male,89.41,2.980333,1.832596,561.44,18.714667,64.316033
1,Thur,Female,82.42,2.575625,1.230516,534.89,16.715312,60.213942
2,Fri,Male,26.93,2.693000,1.291468,198.57,19.857000,100.317201
3,Fri,Female,25.03,2.781111,0.881461,127.31,14.145556,22.930178
4,Sat,Male,181.95,3.083898,3.208969,1227.35,20.802542,96.752916
5,Sat,Female,78.45,2.801786,1.523941,551.05,19.680357,77.553915
6,Sun,Male,186.78,3.220345,1.615877,1269.46,21.887241,83.341231
7,Sun,Female,60.61,3.367222,1.292257,357.70,19.872222,61.426607

In [34]:
result.to_excel('dataset/day-sex-tip-total.xlsx', sheet_name = 'Sheet_1', index = False)